; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-2-6-152)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p2-0 - location
	p6-2 - location
	p1-5 - location
	p1-6 - location
	p5-0 - location
	p5-2 - location
	p5-6 - location
	p3-0 - location
	p3-1 - location
	p4-0 - location
	p4-3 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s2)
	(at driver3 s1)
	(at driver4 s6)
	(at truck1 s5)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s5)
	(at package2 s1)
	(at package3 s3)
	(at package4 s5)
	(at package5 s6)
	(at package6 s6)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 29)
	(= (time-to-walk p2-0 s2) 29)
	(= (time-to-walk s0 p2-0) 45)
	(= (time-to-walk p2-0 s0) 45)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 9)
	(= (time-to-walk p6-2 s6) 9)
	(= (time-to-walk s2 p6-2) 13)
	(= (time-to-walk p6-2 s2) 13)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 30)
	(= (time-to-walk p1-5 s1) 30)
	(= (time-to-walk s5 p1-5) 7)
	(= (time-to-walk p1-5 s5) 7)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(= (time-to-walk s1 p1-6) 17)
	(= (time-to-walk p1-6 s1) 17)
	(= (time-to-walk s6 p1-6) 23)
	(= (time-to-walk p1-6 s6) 23)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 16)
	(= (time-to-walk p5-0 s5) 16)
	(= (time-to-walk s0 p5-0) 12)
	(= (time-to-walk p5-0 s0) 12)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 41)
	(= (time-to-walk p5-2 s5) 41)
	(= (time-to-walk s2 p5-2) 33)
	(= (time-to-walk p5-2 s2) 33)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 39)
	(= (time-to-walk p5-6 s5) 39)
	(= (time-to-walk s6 p5-6) 37)
	(= (time-to-walk p5-6 s6) 37)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 22)
	(= (time-to-walk p3-0 s3) 22)
	(= (time-to-walk s0 p3-0) 11)
	(= (time-to-walk p3-0 s0) 11)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 30)
	(= (time-to-walk p3-1 s3) 30)
	(= (time-to-walk s1 p3-1) 32)
	(= (time-to-walk p3-1 s1) 32)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 18)
	(= (time-to-walk p4-0 s4) 18)
	(= (time-to-walk s0 p4-0) 1)
	(= (time-to-walk p4-0 s0) 1)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 8)
	(= (time-to-walk p4-3 s4) 8)
	(= (time-to-walk s3 p4-3) 25)
	(= (time-to-walk p4-3 s3) 25)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 37)
	(= (time-to-drive s0 s4) 37)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 4)
	(= (time-to-drive s2 s4) 4)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 18)
	(= (time-to-drive s4 s5) 18)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 46)
	(= (time-to-drive s2 s6) 46)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 23)
	(= (time-to-drive s4 s6) 23)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 20)
	(= (time-to-drive s5 s6) 20)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 33)
	(= (time-to-drive s1 s0) 33)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 23)
	(= (time-to-drive s5 s0) 23)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 11)
	(= (time-to-drive s0 s3) 11)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 45)
	(= (time-to-drive s2 s3) 45)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 4)
	(= (time-to-drive s4 s3) 4)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 32)
	(= (time-to-drive s5 s3) 32)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 7)
	(= (time-to-drive s6 s3) 7)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 43)
	(= (time-to-drive s5 s2) 43)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 33)
	(= (time-to-drive s2 s1) 33)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 21)
	(= (time-to-drive s6 s1) 21)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s5)
	(at driver3 s1)
	(at driver4 s0)
	(at truck1 s1)
	(at truck2 s5)
	(at package1 s3)
	(at package2 s1)
	(at package3 s2)
	(at package4 s1)
	(at package5 s1)
	(at package6 s5)
	))

(:metric minimize (+ (* 3 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (walk driver1 s6 p5-6)
   deleted: (at driver1 s6)
   added: (at driver1 p5-6)
   goals met: 2 of 11
2. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 1 of 11
3. (walk driver1 p5-6 s5)
   deleted: (at driver1 p5-6)
   added: (at driver1 s5)
   goals met: 2 of 11
4. (load-truck package1 truck1 s5)
   deleted: (at package1 s5)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 11
5. (load-truck package4 truck1 s5)
   deleted: (at package4 s5)
   added: (in package4 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 2 of 11
6. (board-truck driver1 truck1 s5)
   deleted: (at driver1 s5) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 1 of 11
7. (drive-truck truck1 s5 s6 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   changed: (fuel-used) from 0 to 260
   goals met: 1 of 11
8. (load-truck package5 truck1 s6)
   deleted: (at package5 s6)
   added: (in package5 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 1 of 11
9. (load-truck package6 truck1 s6)
   deleted: (at package6 s6)
   added: (in package6 truck1)
   changed: (load truck1) from 3 to 4, (fuel-per-minute truck1) from 16 to 20
   goals met: 1 of 11
10. (drive-truck truck1 s6 s5 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   changed: (fuel-used) from 260 to 660
   goals met: 1 of 11
11. (unload-truck package6 truck1 s5)
   deleted: (in package6 truck1)
   added: (at package6 s5)
   changed: (load truck1) from 4 to 3, (fuel-per-minute truck1) from 20 to 16
   goals met: 2 of 11
12. (disembark-truck driver3 truck2 s1)
   deleted: (driving driver3 truck2)
   added: (at driver3 s1) (empty truck2)
   goals met: 3 of 11
13. (drive-truck truck1 s5 s3 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (fuel-used) from 660 to 1172
   goals met: 3 of 11
14. (unload-truck package1 truck1 s3)
   deleted: (in package1 truck1)
   added: (at package1 s3)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 4 of 11
15. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 3 of 11
16. (load-truck package3 truck1 s3)
   deleted: (at package3 s3)
   added: (in package3 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 3 of 11
17. (drive-truck truck1 s3 s2 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 1172 to 1892
   goals met: 3 of 11
18. (drive-truck truck2 s1 s6 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   changed: (fuel-used) from 1892 to 2102
   goals met: 3 of 11
19. (unload-truck package3 truck1 s2)
   deleted: (in package3 truck1)
   added: (at package3 s2)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 4 of 11
20. (drive-truck truck1 s2 s1 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 2102 to 2531
   goals met: 5 of 11
21. (unload-truck package4 truck1 s1)
   deleted: (in package4 truck1)
   added: (at package4 s1)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 6 of 11
22. (drive-truck truck2 s6 s1 driver3)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   changed: (fuel-used) from 2531 to 2741
   goals met: 6 of 11
23. (disembark-truck driver1 truck1 s1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 6 of 11
24. (unload-truck package5 truck1 s1)
   deleted: (in package5 truck1)
   added: (at package5 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 11
25. (walk driver1 s1 p1-5)
   deleted: (at driver1 s1)
   added: (at driver1 p1-5)
   goals met: 7 of 11
26. (walk driver1 p1-5 s5)
   deleted: (at driver1 p1-5)
   added: (at driver1 s5)
   goals met: 8 of 11
27. (drive-truck truck2 s1 s0 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 2741 to 3071
   goals met: 8 of 11
28. (walk driver4 s6 p5-6)
   deleted: (at driver4 s6)
   added: (at driver4 p5-6)
   goals met: 8 of 11
29. (walk driver4 p5-6 s5)
   deleted: (at driver4 p5-6)
   added: (at driver4 s5)
   goals met: 8 of 11
30. (walk driver4 s5 p5-0)
   deleted: (at driver4 s5)
   added: (at driver4 p5-0)
   goals met: 8 of 11
31. (walk driver4 p5-0 s0)
   deleted: (at driver4 p5-0)
   added: (at driver4 s0)
   goals met: 9 of 11
32. (drive-truck truck2 s0 s5 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   changed: (fuel-used) from 3071 to 3301
   goals met: 10 of 11
33. (disembark-truck driver3 truck2 s5)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 10 of 11
34. (walk driver3 s5 p1-5)
   deleted: (at driver3 s5)
   added: (at driver3 p1-5)
   goals met: 10 of 11
35. (walk driver3 p1-5 s1)
   deleted: (at driver3 p1-5)
   added: (at driver3 s1)
   goals met: 11 of 11
